# WEEK 03 - DESCRIPTIVE STATISTICS - 24.01

#Project Challenges

#PandasDescriptive Statistics Challenges

#Solve the following pandas challenges:

In [9]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [19]:
!ls

life_expectancy_1950.csv        pc_Descriptive Statistics.ipynb

In [20]:
# 1. read the life expectancy cleaned dataset into your notebook 
#(the dataset you created in Data Cleansing before). 
#If you want to use country as the index you may use the `index_col` parameter while reading it from the file:


import pandas as pd

data = pd.read_csv('life_expectancy_1950.csv')
data

                     country  year  life expectancy
0                Afghanistan  1950            26.85
1                    Albania  1950            54.48
2                    Algeria  1950            42.77
3                     Angola  1950            30.70
4        Antigua and Barbuda  1950            57.97
...                      ...   ...              ...
13702  Virgin Islands (U.S.)  2016            80.82
13703                  Yemen  2016            64.92
13704                 Zambia  2016            57.10
13705               Zimbabwe  2016            61.69
13706            South Sudan  2016            56.10

[13707 rows x 3 columns]

In [12]:
data.head()

               country  year  life expectancy
0          Afghanistan  1950            26.85
1              Albania  1950            54.48
2              Algeria  1950            42.77
3               Angola  1950            30.70
4  Antigua and Barbuda  1950            57.97

In [22]:
# 2. calculate the mean life expectancy

data_mean = data ['life expectancy'].mean()

In [23]:
data_mean

62.98883344276646

In [25]:
# 3. calculate the mean life expectancy for the year 2000

boolean_mask = data ['year'] == 2000

In [27]:
life_exp_2000 = data.loc[boolean_mask]

In [28]:
life_exp_mean_2000 = life_exp_2000.mean(numeric_only=True)
life_exp_mean_2000

year               2000.000000
life expectancy      68.077703
dtype: float64

In [36]:
# 4. calculate the median for 1995
boolean_mask = data['year'] == 1995

In [38]:
data_1995 = data.loc[boolean_mask]
data_1995

                    country  year  life expectancy
9120            Afghanistan  1995            49.40
9121                Albania  1995            73.70
9122                Algeria  1995            71.60
9123         American Samoa  1995            70.60
9124                Andorra  1995            82.60
...                     ...   ...              ...
9323  Virgin Islands (U.S.)  1995            76.23
9324                  Yemen  1995            60.30
9325                 Zambia  1995            46.90
9326               Zimbabwe  1995            56.00
9327            South Sudan  1995            52.70

[208 rows x 3 columns]

In [45]:
median_1995 = data_1995['life expectancy'].median()
median_1995

70.0

In [47]:
# 5. calculate the standard deviation

data.std(numeric_only=True)

year               19.364466
life expectancy    11.895572
dtype: float64

In [52]:
data['life expectancy'].std()

11.89557179977114

In [68]:
# 6. find the highest life expectancy

In [56]:
life_expectancy_max = data['life expectancy'].max()
life_expectancy_max

84.8

In [66]:
# 7. find the country and year for the highest life expectancy

life_expectancy_max_year = data.loc[data['life expectancy'] == life_expectancy_max]
life_expectancy_max_year

       country  year  life expectancy
12879  Andorra  2013             84.8
13087  Andorra  2014             84.8
13295  Andorra  2015             84.8
13503  Andorra  2016             84.8

In [67]:
life_expectancy_max_year['year'].unique()

array([2013, 2014, 2015, 2016])

In [68]:
# 8. find the lowest life expectancy

life_expectancy_min = data['life expectancy'].min()
life_expectancy_min

13.2

In [71]:
# 9. find the country and year was the lowest life expectancy

boolean_mask = data['life expectancy'] == 13.2

lowest_life_ex = data.loc[boolean_mask]

In [72]:
lowest_life_ex

     country  year  life expectancy
9068  Rwanda  1994             13.2

In [73]:
# 10. find the 90% quantile of the life expectancy

quantile_90 = data['life expectancy'].quantile(q=0.9)
quantile_90

76.4